OpenFOAM-v2106/tutorials/compressible/rhoSimpleFoam/squareBendLiq/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    "(?i).*walls"
    {
        type            fixedValue;
        value           uniform 350;

        // For general testing purposes:
        type            exprFixedValue;

        variables
        (
            "Tcrit = 500"
            "par1 = mag(internalField(U))/snGrad(T)"
        );

        valueExpr
        #{
            Tcrit
          + par1*internalField(T) * max((Tcrit-T)/(Tcrit)*deltaT()/time(),0)
        #};
    }
}


// ************************************************************************* //
